backend/app/controllers/api/v1/videos_controller.rb

  def index
    @videos = Video.includes(:user).order(created_at: :desc)
---
SELECT "videos".* FROM "videos" ORDER BY "videos"."created_at" DESC